## 예제 2-14 대괄호를 이용한 슬라이스 검색

In [1]:
import pandas as pd

In [2]:
ct = pd.read_csv("../data/2017_college_tuition.csv",encoding='euc-kr')

In [3]:
ct_ser = ct['학교명']

In [4]:
ct_ser[10:20]

10      금오공과대학교
11      대구교육대학교
12        목포대학교
13      목포해양대학교
14        부경대학교
15      부산교육대학교
16        부산대학교
17    서울과학기술대학교
18      서울교육대학교
19        서울대학교
Name: 학교명, dtype: object

In [6]:
ct_slice = ct[10:20]

In [7]:
ct_slice

          학교명 설립구분  평균등록금
10    금오공과대학교  국공립   3769
11    대구교육대학교  국공립   3604
12      목포대학교  국공립   3895
13    목포해양대학교  국공립   3424
14      부경대학교  국공립   4042
15    부산교육대학교  국공립   3024
16      부산대학교  국공립   4325
17  서울과학기술대학교  국공립   5405
18    서울교육대학교  국공립   3088
19      서울대학교  국공립   5962

In [8]:
ct_slice.head()

        학교명 설립구분  평균등록금
10  금오공과대학교  국공립   3769
11  대구교육대학교  국공립   3604
12    목포대학교  국공립   3895
13  목포해양대학교  국공립   3424
14    부경대학교  국공립   4042

In [9]:
ct_slice.shape

(10, 3)

In [ ]:
# slice => []와 같은 효과

In [10]:
ct.__getitem__(slice(10,20)).head()

        학교명 설립구분  평균등록금
10  금오공과대학교  국공립   3769
11  대구교육대학교  국공립   3604
12    목포대학교  국공립   3895
13  목포해양대학교  국공립   3424
14    부경대학교  국공립   4042